
def area(a):
    '''
    Возвращает площадь квадрата со стороной a.
        Параметры:
            a (int или float): сторона квадрата
        Возвращаемое значение:
            int или float: площадь квадрата со стороной a

    >>> area(3)
    9
    '''
    return a * a


def perimeter(a):
    '''
    Возвращает периметр квадрата со стороной a.
        Параметры:
            a (int или float): сторона квадрата
        Возвращаемое значение:
            int или float: периметр квадрата со стороной a

    >>> area(3)
    12
    '''
    return 4 * a
